In [1]:
import pandas as pd
df = pd.read_csv("/home/eben-success/Desktop/Projects/Machine Learning/Machine_Learning_Ex_-_Mini_Projects/12. Naive Bayesian/titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
df.drop(['PassengerId', 'Name', 'Ticket', 'Cabin', 'Embarked', 'Parch', 'SibSp', 'Pclass'], axis=1, inplace=True)
df.head()

   Survived     Sex   Age     Fare
0         0    male  22.0   7.2500
1         1  female  38.0  71.2833
2         1  female  26.0   7.9250
3         1  female  35.0  53.1000
4         0    male  35.0   8.0500

In [3]:
target = df.Survived
input = df.drop('Survived', axis=1)

In [4]:
dummies = pd.get_dummies(input.Sex)
dummies

     female  male
0         0     1
1         1     0
2         1     0
3         1     0
4         0     1
..      ...   ...
886       0     1
887       1     0
888       1     0
889       0     1
890       0     1

[891 rows x 2 columns]

In [5]:
input = pd.concat([input, dummies], axis='columns')
input.head()

      Sex   Age     Fare  female  male
0    male  22.0   7.2500       0     1
1  female  38.0  71.2833       1     0
2  female  26.0   7.9250       1     0
3  female  35.0  53.1000       1     0
4    male  35.0   8.0500       0     1

In [6]:
input.drop('Sex', axis='columns', inplace=True)

In [7]:
input.head()

    Age     Fare  female  male
0  22.0   7.2500       0     1
1  38.0  71.2833       1     0
2  26.0   7.9250       1     0
3  35.0  53.1000       1     0
4  35.0   8.0500       0     1

In [8]:
input.isnull().sum()

Age       177
Fare        0
female      0
male        0
dtype: int64

In [9]:
input.fillna(input.Age.mean(), inplace=True)

In [10]:
input.isnull().sum()

Age       0
Fare      0
female    0
male      0
dtype: int64

## Training the model

In [11]:
from sklearn.model_selection import train_test_split

In [12]:
X_train, X_test, y_train, y_test = train_test_split(input, target, test_size=0.3, random_state=10)

### Using Naive Bayesian

In [13]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [14]:
model.fit(X_train, y_train)

GaussianNB()

In [16]:
model.score(X_test, y_test)

0.8059701492537313